Florish/app/controllers/payments_controller.rb

  def new
    @payment = Payment.new
    @total_price = current_order.order_items.map{|oi| oi.total_price}.reduce{|sum, p| sum+p}.to_s
---
SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]
SELECT COUNT(*) FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]