Florish/app/controllers/products_controller.rb

SELECT "order_items".* FROM "order_items"  WHERE "order_items"."order_id" = ?  [["order_id", 1]]
---
  def index
    @products = Product.all
    @order_item = current_order.order_items.new